{"categories":["Antagonist Groups","Demon","Antagonists"],"html":"<div class=\"mw-parser-output\"><p>The <b>Spider Family</b> was a clan of <a href=\"/wiki/Demon\" title=\"Demon\">Demon</a> on <a href=\"/wiki/Natagumo_Mountain\" title=\"Natagumo Mountain\">Natagumo Mountain</a> with spider-like traits and abilities, formed and led by Lower Rank 5, <a href=\"/wiki/Rui\" title=\"Rui\">Rui</a>, of the <a href=\"/wiki/Twelve_Kizuki\" title=\"Twelve Kizuki\">Twelve Kizuki</a>.\n</p>\n<div id=\"toc\" class=\"toc\"><input type=\"checkbox\" role=\"button\" id=\"toctogglecheckbox\" class=\"toctogglecheckbox\" style=\"display:none\"><div class=\"toctitle\" lang=\"en\" dir=\"ltr\"><h2>Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Profile\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Profile</span></a></li>\n<li class=\"toclevel-1 tocsection-2\"><a href=\"#Members\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Members</span></a></li>\n<li class=\"toclevel-1 tocsection-3\"><a href=\"#Initiation\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Initiation</span></a></li>\n<li class=\"toclevel-1 tocsection-4\"><a href=\"#Role\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Role</span></a></li>\n<li class=\"toclevel-1 tocsection-5\"><a href=\"#Synopsis\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Synopsis</span></a></li>\n<li class=\"toclevel-1 tocsection-6\"><a href=\"#Trivia\"><span class=\"tocnumber\">6</span> <span class=\"toctext\">Trivia</span></a></li>\n</ul>\n</div>\n\n<h2><span class=\"mw-headline\" id=\"Profile\">Profile</span></h2>\n<p>The Spider Family was a group of five Demons: the <a href=\"/wiki/Spider_Demon_(Father)\" title=\"Spider Demon (Father)\">Father Spider Demon</a>, <a href=\"/wiki/Spider_Demon_(Mother)\" title=\"Spider Demon (Mother)\">Mother Spider Demon</a>, <a href=\"/wiki/Spider_Demon_(Daughter)\" title=\"Spider Demon (Daughter)\">Daughter Spider Demon</a>, <a href=\"/wiki/Spider_Demon_(Son)\" title=\"Spider Demon (Son)\">Son Spider Demon</a>, and Rui, who portrayed himself as the youngest brother of the family, but in actuality was the true leader of the group. However, there were likely more members initially as the Daughter noted there were other Demons part of the family that were located on the mountain, shown in the <a href=\"/wiki/Kimetsu_no_Yaiba_(Anime)\" title=\"Kimetsu no Yaiba (Anime)\">anime</a>. Such members included the \"Oldest Sister,\" another \"Younger sister,\" \"Youngest Brother,\" and the \"Youngest Sister.\" However, they were all disposed of by Rui when they either refused to play along with his given \"Family\" roles or failed to live up to his expectations. He punished them by having their intelligence removed and strung them up in the trees until morning came, burning them to death by the sun until only the Mother, Father, Son, and Daughter remained.\n</p>\n<figure class=\"thumb tright show-info-icon\" style=\"width: 282px\"> \t<a href=\"https://static.wikia.nocookie.net/kimetsu-no-yaiba/images/8/87/The_Daughter_Spider_Demon_welcomed_to_the_family.png/revision/latest?cb=20190817173804\" class=\"image\"><img alt=\"\" src=\"/images/The_Daughter_Spider_Demon_welcomed_to_the_family.png\" decoding=\"async\" width=\"280\" height=\"158\" class=\"thumbimage\"></a> \t \t<figcaption class=\"thumbcaption\"> \t\t \t\t\t<a href=\"/wiki/File:The_Daughter_Spider_Demon_welcomed_to_the_family.png\" class=\"info-icon\"><svg><use xlink:href=\"#wds-icons-info-small\"></use></svg></a> \t\t \t\t \t\t \t\t\t<p class=\"caption\">Original members of the family.</p> \t\t \t</figcaption> </figure>\n<p>The Spider Family was an oddity, as Demons typically don't form groups. Although calling themselves a \"Family,\" the clan was highly dysfunctional at best and downright violent and sadistic at worst within their own kin, with torturous levels of physical and psychological abuse being commonly practiced. There was no sign of real love or trust between its members and as <a href=\"/wiki/Tanjiro_Kamado\" title=\"Tanjiro Kamado\">Tanjiro Kamado</a> put it, it was a fake bond that reeked of mistrust, fear and disgust.\n</p><p>Rui, however, took to great lengths to try to protect this \"Family\" even if they all, for the most part, lived completely terrified of him. Nonetheless, the clan's members were all fairly powerful Demons that preyed on many humans and spelled the doom of many <a href=\"/wiki/Demon_Slayer_Corps\" title=\"Demon Slayer Corps\">Demon Slayer Corps</a>' Mizunoto.\n</p>\n<h2><span class=\"mw-headline\" id=\"Members\">Members</span></h2>\n<table cellspacing=\"1/6\" cellpadding=\"2\" align=\"center\" width=\"auto\" style=\"border: 1px solid #5e111f; width:130px;\">\n<tbody><tr>\n<th colspan=\"5\" style=\"background: #5e111f; font-size: 110%;\"><font color=\"#FFF\">Spider Family</font>\n</th></tr>\n<tr>\n<th class=\"portal\" style=\"border: 1px solid #000;\"><div style=\"valign: center; text-align: center; overflow: hidden; width: 130px; height: 130px;\"><a href=\"/wiki/Rui\" title=\"Rui\"><img alt=\"Rui\" src=\"/images/Rui_colored_profile.png\" decoding=\"async\" width=\"130\" height=\"130\"></a></div>\n</th>\n<th class=\"portal\" style=\"border: 1px solid #000;\"><div style=\"valign: center; text-align: center; overflow: hidden; width: 130px; height: 130px;\"><a href=\"/wiki/Spider_Demon_(Father)\" title=\"Spider Demon (Father)\"><img alt=\"Spider Demon (Father)\" src=\"/images/Father_Spider_Demon_profile.png\" decoding=\"async\" width=\"130\" height=\"130\"></a></div>\n</th>\n<th class=\"portal\" style=\"border: 1px solid #000;\"><div style=\"valign: center; text-align: center; overflow: hidden; width: 130px; height: 130px;\"><a href=\"/wiki/Spider_Demon_(Mother)\" title=\"Spider Demon (Mother)\"><img alt=\"Spider Demon (Mother)\" src=\"/images/Mother_Spider_Demon_profile.png\" decoding=\"async\" width=\"130\" height=\"130\" class=\"lazyload\"></a></div>\n</th>\n<th class=\"portal\" style=\"border: 1px solid #000;\"><div style=\"valign: center; text-align: center; overflow: hidden; width: 130px; height: 130px;\"><a href=\"/wiki/Spider_Demon_(Son)\" title=\"Spider Demon (Son)\"><img alt=\"Spider Demon (Son)\" src=\"/images/Son_Spider_Demon_profile.png\" decoding=\"async\" width=\"130\" height=\"130\" class=\"lazyload\"></a></div>\n</th>\n<th class=\"portal\" style=\"border: 1px solid #000;\"><div style=\"valign: center; text-align: center; overflow: hidden; width: 130px; height: 130px;\"><a href=\"/wiki/Spider_Demon_(Daughter)\" title=\"Spider Demon (Daughter)\"><img alt=\"Spider Demon (Daughter)\" src=\"/images/Daughter_Spider_Demon_profile.png\" decoding=\"async\" width=\"130\" height=\"130\" class=\"lazyload\"></a></div>\n</th></tr>\n<tr>\n<th style=\"border: 1px solid #000;\"><small><b><a href=\"/wiki/Rui\" title=\"Rui\">Rui</a><br>(Youngest Son)</b></small>\n</th>\n<th style=\"border: 1px solid #000;\"><small><b><a href=\"/wiki/Spider_Demon_(Father)\" title=\"Spider Demon (Father)\">Spider Demon (Father)</a></b></small>\n</th>\n<th style=\"border: 1px solid #000;\"><small><b><a href=\"/wiki/Spider_Demon_(Mother)\" title=\"Spider Demon (Mother)\">Spider Demon (Mother)</a></b></small>\n</th>\n<th style=\"border: 1px solid #000;\"><small><b><a href=\"/wiki/Spider_Demon_(Son)\" title=\"Spider Demon (Son)\">Spider Demon (Son)</a></b></small>\n</th>\n<th style=\"border: 1px solid #000;\"><small><b><a href=\"/wiki/Spider_Demon_(Daughter)\" title=\"Spider Demon (Daughter)\">Spider Demon (Daughter)</a></b></small>\n</th></tr></tbody></table>\n<p><br>\n</p>\n<h2><span class=\"mw-headline\" id=\"Initiation\">Initiation</span></h2>\n<p>As seen in the&nbsp;<a href=\"/wiki/Spider_Demon_(Daughter)\" title=\"Spider Demon (Daughter)\">Daughter Spider Demon</a>'s memories, upon being accepted and adopted into his \"Family\", Rui would first strengthen and augment the power of each new \"family member\" by giving a single drop of his own blood and have them drink it. The blood would then painfully strengthen them and give them access to the various, string-based <a href=\"/wiki/Blood_Demon_Art\" title=\"Blood Demon Art\">Blood Demon Arts</a> similar to Rui's own abilities. If they survived the process,&nbsp;Rui would then proceed to forcibly alter the newly adopted member's physical appearance to resemble his own before officially welcoming them into the \"Family\".\n</p>\n<h2><span class=\"mw-headline\" id=\"Role\">Role</span></h2>\n<p>In accordance with what Rui believes to be what constitutes as a \"Family,\" he forces each and every member of his \"Family\" to fulfill a specific role. The \"Father\" and \"Mother\"&nbsp;are supposed to protect and give their lives for their \"children\" while the \"Son\" and \"Daughter\" are suppose to protect their \"Younger Brother\" with their lives&nbsp;without fail or compromise. Rui believed that these sacrificial-like roles to be what truly makes up a Family, not at all understanding the concept of familial love that a true family has with each other and this being the true reason why they are willing to sacrifice themselves for their siblings/children. He forces his family members to go along with these roles by using terror, pain and force to make them submit to him which deluded Rui into believing that these incredibly toxic relationships created through these violent methods to be a true and powerful \"bond\" between them. Due to Rui's desire for a family, he would force the family members to perform typical Family-related activities such as making them gather around in a room and sit together, with empty plates and bowls of food presented to them to simulate a family dinner, as seen in the <a href=\"/wiki/Spider_Demon_(Daughter)\" title=\"Spider Demon (Daughter)\">Daughter Spider Demon</a>'s flashbacks.\n</p>\n<h2><span class=\"mw-headline\" id=\"Synopsis\">Synopsis</span></h2>\n<p>After healing their injuries, <a href=\"/wiki/Tanjiro_Kamado\" title=\"Tanjiro Kamado\">Tanjiro Kamado</a>, <a href=\"/wiki/Zenitsu_Agatsuma\" title=\"Zenitsu Agatsuma\">Zenitsu&nbsp;Agatsuma</a>, and <a href=\"/wiki/Inosuke_Hashibira\" title=\"Inosuke Hashibira\">Inosuke Hashibira</a>, are sent on a mission in Natagumo Mountain. They stumble into a forest and encounter an injured fellow Mizunoto. Before he tries to warn them of the danger ahead, he is pulled away back into the forest by a thread.\n</p><p>Tanjiro and Inosuke venture into the forest, only to find it filled with spider webs and bodies of several Mizunoto lying dead. They find <a href=\"/wiki/Murata\" title=\"Murata\">Murata</a>, a survivor who explains that their members started to erratically attack one another, resulting in a massacre. The three are soon surrounded by the moving bodies of their comrades which attack them. The trio defend themselves as Tanjiro realizes they are being manipulated and there are both corpses and living people controlled. Tanjiro discovers the spider threads are controlling their comrades which are placed by the miniature spider demons around. Inosuke tries to kill them, but they are too many and his actions are in vain. Tanjiro pleads with him to detect the source of the spiders so they can avoid killing their comrades. Annoyed, Inosuke complies and detects the <a href=\"/wiki/Spider_Demon_(Mother)\" title=\"Spider Demon (Mother)\">Mother Spider Demon</a> using <b><a href=\"/wiki/Beast_Breathing\" title=\"Beast Breathing\">Beast Breathing</a> Seventh Form: Spatial Awareness</b>. Murata stays behind to fight the controlled Mizunoto while the two went after the Mother.\n</p><p>On the way, they fight <a href=\"/wiki/Ozaki\" title=\"Ozaki\">Ozaki</a> who is controlled by the Demon, her attacks made stronger by the manipulation. Her attacks take a toll on her as she is forced to fight to the point of her bones breaking. Tanjiro has her follow him and then turns around to launch her onto a tree's branch, entangling the threads. Inosuke follows suit with several Mizunoto. Annoyed by this, the Mother uses her powers to break the necks of her victims and kills them on the spot, deeply enraging Tanjiro.\n</p><p>As Tanjiro and Inosuke continue on, the Mother unleashes her strongest puppet monster on the two of them. The monster proves to be incredibly strong and Inosuke sustains injuries in the process. With a combination attack, Tanjiro catapults Inosuke into the air, giving him the necessary power to cut the monster down. Inspired by this, Inosuke in turn launches Tanjiro to the Mother, who realizing her current life is full of torment and embraces her death with relief. Tanjiro notices her intentions and gently slices her head with <b><a href=\"/wiki/Water_Breathing\" title=\"Water Breathing\">Water Breathing</a> Fifth Form: Blessed Rain After the Drought</b> so she feels no pain. Before dying, the Mother bids Tanjiro good luck and reveals a member of the <a href=\"/wiki/Twelve_Kizuki\" title=\"Twelve Kizuki\">Twelve Kizuki</a> is on the mountain.\n</p><p>Meanwhile Zenitsu, who was left behind, ventures into the forest as he realizes that <a href=\"/wiki/Nezuko_Kamado\" title=\"Nezuko Kamado\">Nezuko Kamado</a>, his crush, was inadvertently thrown into the mountain as Tanjiro was carrying her. Zenitsu follows after them, worried for her safety and wanting to protect her. On his way, he stumbles upon a terrifying sight of a house held by spider webs with hanging corpses on the threads. He is confronted by the <a href=\"/wiki/Spider_Demon_(Son)\" title=\"Spider Demon (Son)\">Son Spider Demon</a>, who tries to prey on him. Zenitsu, too scared to fight, tries to keep his distance from him and his spider minions, but is told by the Son that he was bitten by his minion which poisoned him. With the poison already in his body, the Son tells him he will suffer several symptoms before ultimately become a minion in 30 minutes, further horrifying Zenitsu until he falls unconscious.\n</p><p>The Son finds Zenitsu weird but tries to consume him while he was unconscious. Zenitsu, in his trance, starts a rampage, putting the Son on alert. Zenitsu has flashbacks of his training days as he fights the spiders, with the Son realizing Zenitsu is only able to employ a single technique and gloated his alleged victory. Zenitsu remembers his <a href=\"/wiki/Jigoro_Kuwajima\" title=\"Jigoro Kuwajima\">master</a> saying that it is fine that he could only use one technique, which just means that Zenitsu has to work hard to master that one technique. He pushes himself to his limits and in an instant, defeats the Son. Weakened by the poison, he tries to control his breathing to the best of abilities and slow down its effects.\n</p><p>While in the forest, Tanjiro and Inosuke find the <a href=\"/wiki/Spider_Demon_(Daughter)\" title=\"Spider Demon (Daughter)\">Daughter Spider Demon</a> who summons the <a href=\"/wiki/Spider_Demon_(Father)\" title=\"Spider Demon (Father)\">Father Spider Demon</a> while she flees. The Father yields to the Demon Slayers to stay away from his family as he demonstrates his strength, almost landing a hit on Inosuke but is stopped by Tanjiro who tries to unsuccessfully slice his arm. Inosuke attempts the same but to no avail, and the two are pushed away by the Father's fortitude. The two run away and Tanjiro strategically cuts a tree so it falls over the Father. He tries to seize the opportunity to use his strongest technique to kill the Father, but the latter manages to stand up and use the same tree to catapult Tanjiro away from them. Tanjiro yells Inosuke to defend his life until he can return and help him.\n</p><p>Inosuke is forced to run but the Father discovers his location due to his blood drops. Inosuke tries to escape but is then disgusted by how he started to think more strategically like Tanjiro, deciding to fight back against the Father. His first slice sticks into the Father's arm until he uses his second blade to pound the first, slicing his arm. The Father runs away with Inosuke in pursuit and he finds him in a tree. Inosuke gloats that the Father is afraid of him, but soon after the demon sheds his skin causing an increase in muscle mass and he regenerates his arm. Inosuke realizes he is outmatched and resigns himself to his fate until he remembers the words of the people he came across, including Tanjiro.\n</p><p>Regaining his senses, Inosuke tries to fight against the Father but is overwhelmed by his speed and power. He finds an opening but his blades break when trying to cut the Father's body. The Father grabs him and tries to crush his head, with Inosuke receiving flashbacks of his <a href=\"/wiki/Kotoha_Hashibira\" title=\"Kotoha Hashibira\">mother</a> as he is on the verge of death. The Father's arm is then instantly sliced by <a href=\"/wiki/Giyu_Tomioka\" title=\"Giyu Tomioka\">Giyu Tomioka</a> who timely saved Inosuke from death. The Father regrows his arm and tries to attack Giyu, but the <a href=\"/wiki/Water_Breathing\" title=\"Water Breathing\">Water</a> <a href=\"/wiki/Hashira\" title=\"Hashira\">Hashira</a> instantly kills the demon chopping him to pieces, leaving Inosuke dumbfounded of Giyu's strength.\n</p><p>After being separated from Inosuke, Tanjiro finds the Daughter being tortured by Rui. Rui tells Tanjiro to not witness their familial matters, however, Tanjiro protests that he can smell their true feelings and that there is no trust or love between them, just stagnant fear, disgust and mistrust, calling their family a fake. A Mizunoto appears and boldly claims he can kill a \"Demon kid\" easily and climb the ranks that way, however, he is instantly mutilated by Rui's web. Rui then turns his attention to Tanjiro, angered by his claim that their family is a fake. Tanjiro realizes Rui is a powerful adversary and the two fight, with Tanjiro able to avoid Rui's threads. As Tanjiro finds an opening to attack Rui, his blade clashes with Rui's web, breaking it.\n</p><p>Tanjiro is able to narrowly evade with a scratch on his head. Tanjiro tries to dodge Rui's attacks in order to get close and behead him, but cowers in the awe of Rui's threads' power and mobility. Rui asks Tanjiro if he will take back his previous statement but he doesn't respond. He retaliates by enveloping Tanjiro in a web of threads, but Nezuko suddenly appears to shield him from damage to his dismay. Witnessing this, Rui grows obsessed with having Nezuko for himself, believing her to be the perfect \"sister\" and yearning to develop a bond with her. The Daughter protests she is Rui's \"sister,\" but he furiously slashes her in response.\n</p><p>Rui scorns her and the rest of his family for not being able to fulfill the roles he ever gave any of them as he expected them to. The Daughter begs for a chance at redemption and Rui orders her to kill the rest of the invaders to forgive her transgression, which she fearfully complies to. He then tries to negotiate with Tanjiro, wanting him to give up Nezuko to become his sister so that he can escape with his life. Tanjiro instantly refuses, believing Rui's idea of a bond forged through fear is nothing but a farce. Rui gloats that no matter what Tanjiro does, he can't defeat one of the Twelve Kizuki. As Rui explains his philosophy of roles to Tanjiro, he pulls Nezuko out with his threads, capturing her. Tanjiro rushes to rescue Nezuko who furiously scratches at Rui's face, but is forced to stop to avoid Rui's threads. Tanjiro soon discovers Nezuko hung up in several threads as punishment for disobedience. As Tanjiro tries another charge, he stumbles trying to evade more threads and eventually finds himself at the mercy of Rui's beatings.\n</p><p>Rui asks if he is trying to get close to behead him and gives him a chance to do so, revealing that his skin is harder than his threads before catapulting Tanjiro away with a strike. This infuriates Nezuko and Rui responds to her movement by tightening the threads, causing her to fall asleep to regain strength. Tanjiro tries to calm himself and attempts another charge at Rui using <b>Water Breathing Tenth Form: Constant Flux</b>. Using the momentum of the rotation of several slashes, his attacks gain the necessary strength to cut through Rui's threads. Rui, however, activates his <a href=\"/wiki/Blood_Demon_Art\" title=\"Blood Demon Art\">Blood Demon Art</a>, strengthening his threads with his blood and trying to envelop Tanjiro on a thread. Before the attack succeeds, Tanjiro has a flashback of his father's <a href=\"/wiki/Hinokami_Kagura\" title=\"Hinokami Kagura\">Hinokami Kagura</a> and the breathing technique used by him. Imitating his father's respiratory method, Tanjiro increases the power of his attack, slicing through Rui's web. Tanjiro relentlessly pursues Rui who tries to keep him at bay before the two are in the nick of hitting one another. Nezuko is called out by her <a href=\"/wiki/Kie_Kamado\" title=\"Kie Kamado\">mother</a>'s spirit who pleads her to protect Tanjiro, and she awakens her Blood Demon Art, igniting Rui's threads. Defenseless, Tanjiro seizes the chance to behead Lower Rank 5.\n</p>\n<h2><span class=\"mw-headline\" id=\"Trivia\">Trivia</span></h2>\n<ul><li>The Spider Family is one of the only mentioned united groups of Demon actively working together and teaming up to fight, rather than operating on their own. The only other group is the&nbsp;<a href=\"/wiki/Twelve_Kizuki\" title=\"Twelve Kizuki\">Twelve Kizuki</a>&nbsp;working for <a href=\"/wiki/Muzan_Kibutsuji\" title=\"Muzan Kibutsuji\">Muzan Kibutsuji</a>.</li>\n<li>The Spider Family was possibly the only large group of Demons not under Muzan's command that was formed in the entire existence of the Demon race, and it was implied by the Daughter Sister Demon that Rui had to obtain special permission from \"<a href=\"/wiki/Muzan_Kibutsuji\" title=\"Muzan Kibutsuji\">that Man</a>\" in order to form the \"family,\" hinting that all other attempts of Demons creating large groups were all crushed by Muzan himself and later forbidden by him to ever form.</li></ul>\n<!-- \nNewPP limit report\nCached time: 20210112144007\nCache expiry: 1209600\nDynamic content: false\nCPU time usage: 0.040 seconds\nReal time usage: 0.063 seconds\nPreprocessor visited node count: 146/1000000\nPreprocessor generated node count: 0/1000000\nPost‐expand include size: 943/2097152 bytes\nTemplate argument size: 363/2097152 bytes\nHighest expansion depth: 2/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 0/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%    7.453      1 -total\n 94.58%    7.049      5 Template:CropWH\n-->\n\n<!-- Saved in parser cache with key prod:kimetsunoyaiba:pcache:idhash:4254-0!canonical and timestamp 20210112144007 and revision id 77579\n -->\n</div>"}